# Titanic: Data Preparation and Analysis

- In this homework assignment, you will practice data loading, preparation, transformation and analysis.
- Follow each *TODO* instruction to write a Python code snippet with pandas. 
- After you finish coding and debugging, click the `Cell` tab, select `Run All`, and then save the notebook that includes the output of each code cell.

In [1]:
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Load data from files `train.csv` and `test.csv` into two DataFrames `train` and `test`, respectively. Display the first six rows of the two DataFrames, respectively.

In [258]:
#####TODO 1#####
pass
train = pd.read_csv('train.csv', index_col = 'PassengerId')
test = pd.read_csv('test.csv', index_col = 'PassengerId')
train1 = DataFrame(train).head(6)
test1 = DataFrame(test).head(6)
train1

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [214]:
test1

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S

**TODO 2**
Find the number of columns in the `train` and `test` DataFrames, respectively.

In [259]:
#####TODO 2#####
pass
train = DataFrame(train)
test = DataFrame(test)
print(f' The number of columms in train(excould PassengerId column) is:{train.shape[1]} \n The number of columms in test(excould PassengerId column) is:{test.shape[1]}')

 The number of columms in train(excould PassengerId column) is:11
 The number of columms in test(excould PassengerId column) is:10

**TODO 3** 
Show the names of all columns in the `train` DataFrame with an `object` data type.

In [177]:
#####TODO 3#####
pass
train.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**TODO 4**
Show the names of all columns in the `train` DataFrame with missing values.

In [178]:
#####TODO 4#####
pass
train.columns[train.isnull().any()]

Index(['Age', 'Cabin', 'Embarked'], dtype='object')

**TODO 5**
Find the ticket class with the highest number of passengers in the `train` DataFrame.

In [179]:
#####TODO 5#####
pass
train['Pclass'].max()

3

**TODO 6**
Find the ticket class with the highest survival rate in the `train` DataFrame.

*Hint*: use `train.groupby()`.

In [262]:
#####TODO 6#####
pass
train[['Pclass', 'Survived']].groupby(['Pclass']).mean().idxmax()

Survived    1
dtype: int64

**TODO 7**
Column `Embarked`stores the port of embarkation for each passenger. Find the number of missing values in this column of both DataFrames separately. Then fill in any missing value in this column with the port of the highest frequency in the `train` DataFrame. Finally, re-calculate the number of missing values in this column to verify your operations.

In [181]:
#####TODO 7#####
pass
pd.isnull(train['Embarked']).sum()
pd.isnull(test['Embarked']).sum()

print(train['Embarked'].value_counts())
print(test['Embarked'].value_counts())

train['Embarked'] = train['Embarked'].fillna('S')
test['Embarked'] = test['Embarked'].fillna('S')

S    644
C    168
Q     77
Name: Embarked, dtype: int64
S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [182]:
pd.isnull(test['Embarked']).sum()

0

In [183]:
pd.isnull(train['Embarked']).sum()

0

**TODO 8** Output the number of rows in the `train` DataFrame with field `Embarked` equal to 'S'.

In [184]:
#####TODO 8#####
pass
sum(train['Embarked']=='S')

646

**TODO 9** Column `Fare` stores the  the tickt fare each passenger paid. Find the number of missing values in this column of both DataFrames separately. If a DataFrame has missing values in this column, then fill in any missing value with the mean ticket fare of the same ticket class in the `train` DataFrame. Finally, re-calculate the number of missing values in this column to verify your operations.

In [254]:
#####TODO 9#####
pass
print(pd.isnull(train['Fare']).sum())
pd.isnull(test['Fare']).sum()

0

1

In [256]:
print(train['Fare'].mean())
print(test['Fare'].mean())

train['Fare'] = train['Fare'].fillna('32.20')
test['Fare'] = test['Fare'].fillna('35.62')
print(pd.isnull(train['Fare']).sum())
print(pd.isnull(test['Fare']).sum())

32.2042079685746
35.6271884892086
0
0

**TODO 10** 
Output the ticket fare of the passenger in the `test` DataFrame with field `PassengerId` equal to 1044.

In [185]:
#####TODO 10#####
pass

test['Fare'].loc[1044]

nan

**TODO 11**
Compute the survival rate under each distinct level of field `Parch` in the `train` DataFrame.

In [186]:
#####TODO 11#####
pass
train[['Parch', 'Survived']].groupby(['Parch']).mean().sort_values(by='Parch')

       Survived
Parch
0      0.343658
1      0.550847
2      0.500000
3      0.600000
4      0.000000
5      0.200000
6      0.000000

**TODO 12**
Convert the data in column 'Sex' to 1 for 'male' and 0 for 'female' in both DataFrames. Then find the number of zeros in this column of the `train` DataFrame.

In [260]:
####TODO 12####
pass
train['Sex'].replace({'female':0,'male':1},inplace=True)
test['Sex'].replace({'female':0,'male':1},inplace=True)

print(sum(train['Sex']==0))

print(sum(test['Sex']==0))

314
152

**TODO 13** 
Fill in the missing values in column `Age` with the mean age in the `train` DataFrame. Then compute the mean age in the `test` DataFrame.

In [228]:
#####TODO 13#####
pass

train['Age'] = train['Age'].fillna((train['Age'].mean()))

train['Age'].mean()

29.699117647058763

**TODO 14** Add a column `IsChild` to both DataFrames. Assign 1 to this column if a passenger's age is below 16 years old, or 0 otherwise. Then compute the column total. 

*Hint*: use `DataFrame.apply()`. You may define a function.

In [248]:
#####TODO 14#####
pass
def IsChild(Age):
    if Age >=16:
        return 0
    else:
        return 1

train['IsChild'] = train.Age.apply(IsChild)
print(train.IsChild.sum())

test['IsChild'] = test.Age.apply(IsChild)
print(test.IsChild.sum())

83
118

**TODO 15** 
Compute the survival rates of children and adults in the `train` DataFrame.

In [251]:
#####TODO 15#####
pass
train[['IsChild', 'Survived']].groupby(['IsChild']).mean()

         Survived
IsChild
0        0.362624
1        0.590361